A-1 : Scaling

Create the following data frame

In [64]:
import pandas as pd
df = pd.DataFrame({"home_runs": [ 30,  22,  17,  12, 44,   38,  40], 
                      "salary_in_k":[ 700, 450,340, 250, 1200, 800, 950 ]})
df

   home_runs  salary_in_k
0         30          700
1         22          450
2         17          340
3         12          250
4         44         1200
5         38          800
6         40          950

Scale the data using min-max scaler on the scale of 0 to 100

In [65]:
from sklearn.preprocessing import MinMaxScaler

In [66]:
#min-max scaler
df_scale_mm = (df-df.min())/(df.max()-df.min())*100
df_scale_mm

   home_runs  salary_in_k
0     56.250    47.368421
1     31.250    21.052632
2     15.625     9.473684
3      0.000     0.000000
4    100.000   100.000000
5     81.250    57.894737
6     87.500    73.684211

In [67]:
from sklearn.preprocessing import StandardScaler

In [68]:
scaler = MinMaxScaler()
scaled_data = scaler.fit_transform(df)

In [69]:
print(df)

   home_runs  salary_in_k
0         30          700
1         22          450
2         17          340
3         12          250
4         44         1200
5         38          800
6         40          950

In [70]:
print(scaled_data)

[[0.5625     0.47368421]
 [0.3125     0.21052632]
 [0.15625    0.09473684]
 [0.         0.        ]
 [1.         1.        ]
 [0.8125     0.57894737]
 [0.875      0.73684211]]

Use StandardScalar to scale the above data.

In [71]:
df_scaled_z=(df-df.mean())/df.std()

In [72]:
df_scaled_z

   home_runs  salary_in_k
0   0.081200     0.087161
1  -0.568399    -0.639182
2  -0.974398    -0.958773
3  -1.380397    -1.220257
4   1.217997     1.539848
5   0.730798     0.377699
6   0.893198     0.813504

In [73]:
from sklearn.preprocessing import StandardScaler

In [74]:
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df)

In [75]:
print(df)

   home_runs  salary_in_k
0         30          700
1         22          450
2         17          340
3         12          250
4         44         1200
5         38          800
6         40          950

In [76]:
print(scaled_data)

[[ 0.0877058   0.09414485]
 [-0.61394061 -0.69039556]
 [-1.05246962 -1.03559334]
 [-1.49099863 -1.31802789]
 [ 1.31558703  1.66322567]
 [ 0.78935222  0.40796101]
 [ 0.96476382  0.87868526]]

A-3: Normalize

In [84]:
from sklearn import preprocessing
normalized = preprocessing.normalize(df)
print(normalized)

[[0.04281784 0.9990829 ]
 [0.04883057 0.99880708]
 [0.04993762 0.99875234]
 [0.0479448  0.99884999]
 [0.03664204 0.99932845]
 [0.0474465  0.99887378]
 [0.04206799 0.99911475]]

A-4: Scale NBA Player Da

Read nba-player-stats.csv.csv

Inspect the data, and scale all numeric columns

In [87]:
import pandas as pd
df2 = pd.read_csv('nba-player-stats.csv')
df2

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,74.0,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,78.0,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,77.0,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,77.0,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,82.0,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,82.0,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,75.0,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,73.0,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,87.0,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,84.0,231.0,Kansas,947276.0

In [90]:
df2.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height      float64
Weight      float64
College      object
Salary      float64
dtype: object

In [125]:
df2['Salary']

0      0.308359
1      0.270944
2           NaN
3      0.044765
4      0.199010
         ...
452    0.088466
453    0.096217
454    0.034807
455    0.114906
456    0.036701
Name: Salary, Length: 457, dtype: float64

In [113]:
df2['Salary']=(df2['Salary']-df2['Salary'].min())/(df2['Salary'].max()-df2['Salary'].min())
# This shows the normalization of this data, since there are null values in salary